{
    "id":"FlipACoin",
    "type":"random",
    "name":[
        "The Travelling Gambler",
        "The Roving Gambler",
        "The Homeless Gambler"
    ],
    "start":[
        "#startingPoint"
    ],
    "#startingPoint":{
        "msg":[
            "While walking down the path an old man walks up to you. He is obviously homeless, but appears to mean no harm.",
            "While walking the path, you feel a tap on your shoulder. Turning around you see what appears to be a homeless man looking up to you."
        ],
        "actions":[
            {
                "action":"Greet him",
                "eventDo":[
                    ["say","You turn to him and ask him what he wants."],
                    ["goto", ["#theOldMan"]]
                ]
            },
            {
                "action":"Ignore him and continue walking",
                "eventDo":[
                    ["say","You want nothing to do with a man that looks like that.\nYou continue walking and pretend you never saw him."],
                    ["finish"]
                ]
            }
        ]
    },
    "#theOldMan":{
        "msg":[
            "The man clears his throat, \"I am but a weary traveller. I have been earning a living by gambling a single coin at a time.\"\nHe pulls out a coin from his pocket.\n\"Would you like to gamble with me? If this coin lands on heads, I will win and you will owe me a coin. If it lands on tails, I owe you this coin.\""
        ],
        "actions":[
            {
                "action":"Accept his invitation",
                "requirements":[
                    ["have","gold",1]
                ],
                "eventDo":[
                    ["say","You accept his proposal and hand the man a coin."],
                    ["take","gold",1],
                    ["say","The man flips the coin into the air. A moment later it lands in the dirt. The heads side is facing up."],
                    ["say","\"Better luck next time,\" the man says before picking up the coin from the dirt and walking off in the direction that you came from."],
                    ["finish"]
                ]
            },
            {
                "action":"Decline his offer",
                "eventDo":[
                    ["say", "You decline his offer and continue on your way."],
                    ["finish"]
                ]
            }
        ]
    }
}